# Напишите программу, которая выводит на экран результат сложения двух чисел, например, 3 + 5
a, b = int(input()), int(input())
sum = a + b
print(sum)

