#Напишите программу, которая выводит строку:  "I love (hate?) Python
print('I love Python')